#include "cpicture.h"

//----------------------------------------------------------------------------------------------------
//конструктор
//----------------------------------------------------------------------------------------------------
CPicture::CPicture(void)
{
 Width=0;
 Height=0;
}
//----------------------------------------------------------------------------------------------------
//деструктор
//----------------------------------------------------------------------------------------------------
CPicture::~CPicture()
{
}
//----------------------------------------------------------------------------------------------------
//получить изображение в формате RGBA
//----------------------------------------------------------------------------------------------------
void CPicture::GetRGBAImage(unsigned long &width,unsigned long &height,vector<unsigned long> &vector_image)
{
 width=Width;
 height=Height;
 vector_image=vector_Image;
}
//----------------------------------------------------------------------------------------------------
//задать изображение в формате RGBA
//----------------------------------------------------------------------------------------------------
void CPicture::SetRGBAImage(const unsigned long &width,const unsigned long &height,const vector<unsigned long> &vector_image)
{
 Width=width;
 Height=height;
 vector_Image=vector_image;
}
//----------------------------------------------------------------------------------------------------
//задать размер изображения и выделить память
//----------------------------------------------------------------------------------------------------
void CPicture::SetSize(unsigned long width,unsigned long height)
{
 Width=width;
 Height=height;
 vector_Image.resize(Width*Height);
}
//----------------------------------------------------------------------------------------------------
//задать точку
//----------------------------------------------------------------------------------------------------
void CPicture::SetRGBAPixel(unsigned long x,unsigned long y,unsigned long color)
{
 if (x>=Width) return;
 if (y>=Height) return;
 vector_Image[x+y*Width]=color;
}
//----------------------------------------------------------------------------------------------------
//получить точку
//----------------------------------------------------------------------------------------------------
unsigned long CPicture::GetRGBAPixel(unsigned long x,unsigned long y)
{
 if (x>=Width) return(0);
 if (y>=Height) return(0);
 return(vector_Image[x+y*Width]);
}



