#include "stdafx.h"
//------------------------------------------------------------------------------
#include "cdialog_main.h"
//------------------------------------------------------------------------------
class CWinApp_Main:public CWinApp
{
 protected:
  //-Переменные класса-------------------------------------------------------
  //-Функции класса----------------------------------------------------------
  //-Прочее------------------------------------------------------------------
 public:
  //-Конструктор класса------------------------------------------------------
  CWinApp_Main(void);
  //-Деструктор класса-------------------------------------------------------
  ~CWinApp_Main();
  //-Переменные класса-------------------------------------------------------
  //-Замещённые функции предка-----------------------------------------------
  BOOL InitInstance(void);
  //-Новые функции класса----------------------------------------------------
  //-Функции обработки сообщений класса--------------------------------------
  //-Новые функции класса----------------------------------------------------
  //-Прочее------------------------------------------------------------------
};
//-Конструктор класса--------------------------------------------------------
CWinApp_Main::CWinApp_Main(void)
{
}
//-Деструктор класса---------------------------------------------------------
CWinApp_Main::~CWinApp_Main()
{
}
//-Замещённые функции предка-------------------------------------------------
BOOL CWinApp_Main::InitInstance(void)
{ 
 CDialog_Main *cDialog_Main_Ptr=new CDialog_Main((LPSTR)IDD_DIALOG_MAIN,NULL);
 cDialog_Main_Ptr->DoModal();
 delete(cDialog_Main_Ptr);
 return(TRUE);
}
//-Новые функции класса------------------------------------------------------
//-Функции обработки сообщений класса----------------------------------------
//-Новые функции класса------------------------------------------------------
//-Прочее--------------------------------------------------------------------
CWinApp_Main cWinAppMain;


